# St7GetNumTables

Returns the number of tables of the specified type.

long St7GetNumTables(long uID, long TableType, long* NumTables,

long* MaxTableNum)

Input Parameters

uID

Strand7 model file ID.

TableType

One of the table types listed in Table Types.

Output Parameters
NumTables

Number of tables.

MaxTableNum

Maximum table ID.